@extends('layouts.site')
@push('styles')
<style type="text/css">
	/* Move down content because we have a fixed navbar that is 50px tall */
body {
  padding-top: 50px;
  padding-bottom: 20px;
}

</style>
@endpush
@section('content')
<div class="jumbotron" style="background-color: #f3f4fa;">
      <div class="container">
        <h1>เกี่ยวกับวิทยาลัย</h1>
        <hr>
        <h2>ประวัติความเป็นมาของวิทยาลัย</h2>
        <p>วิทยาลัยพลังงานและสิ่งแวดล้อมเป็นหน่วยงานหนึ่งใน สังกัด มหาวิทยาลัยนเรศวร พะเยา จัดตั้งขึ้นในวันที่ 1 ตุลาคม พ.ศ. 2550 นับเป็นสำนักวิชาที่ 12 ของมหาวิทยาลัยนเรศวร พะเยา วิทยาลัยพลังงานและสิ่งแวดล้อมมีพันธกิจหลักในการจัดการเรียนการสอนระดับ ปริญญาตรีและบัณฑิตศึกษาทางด้านพลังงานและสิ่งแวดล้อม ในปีการศึกษา 2552 เปิดสอนหลักสูตรในระดับปริญญาตรี 1 หลักสูตร คือหลักสูตรวิศวกรรมศาสตรบัณฑิต (วศ.บ.) สาขาวิศวกรรม สิ่งแวดล้อม และหลักสูตรในระดับบัณฑิตศึกษา      3 หลักสูตร คือ หลักสูตรวิทยาศาสตรมหาบัณฑิต (วท.ม.) สาขาวิทยาศาสตร์สิ่งแวดล้อม หลักสูตร วิทยาศาสตรมหาบัณฑิต (วท.ม.) สาขาการจัดการทรัพยากรธรรมชาติและสิ่งแวดล้อม หลักสูตรวิศวกรรมมหาบัณฑิต (วศ.ม.) สาขาวิชาวิศวกรรมสิ่งแวดล้อม
        นอกจากนี้ในปีการศึกษา 2553 วิทยาลัยพลังงานและสิ่งแวดล้อมได้จัดทำแผนดำเนินการรับนิสิตในระดับปริญญา ตรี หลักสูตรวิทยาศาสตรบัณฑิตสาขาวิชาทรัพยากร ธรรมชาติและสิ่งแวดล้อม เพื่อเป็นการขยายโอกาสทางการศึกษาให้กับนักศึกษาในภูมิภาคและเพิ่มการผลิต บัณฑิตที่มีความรู้ความสามารถทางด้านสิ่งแวดล้อม ให้เพียงพอต่อความต้องการในการพัฒนาประเทศชาติต่อไป</p>
        
        <h2>ปรัชญา</h2>
        <p>วิทยาลัยพลังงานและสิ่งแวดล้อม มหาวิทยาลัยพะเยา เป็นสถาบันชั้นนำในการพัฒนาเทคโนโลยี พลังงานทดแทนและสิ่งแวดล้อม เพื่อการพัฒนาสังคมและเศรษฐกิจชุมชนอย่างยั่งยืน</p>

        <h2>ปณิธาน</h2>
        <p>มุ่งมั่นที่จะพัฒนาให้เป็นองค์กรในระดับสากล เพื่อพัฒนาบุคลากรและสร้างศักยภาพในการพัฒนาสังคมและเศรษฐกิจชุมชน ให้มีส่วนร่วมในการแก้ปัญหาวิกฤตเศรษฐกิจ พลังงาน และสิ่งแวดล้อม ของประเทศไทยและประชาคมโลก</p>

        <h2>วิสัยทัศน์</h2>
        <p>วิทยาลัยพลังงานและสิ่งแวดล้อม มหาวิทยาลัยพะเยาจะเป็นสถาบันชั้นนำที่จะพัฒนาให้เกิดเทคโนโลยีพลังงานทดแทน และสิ่งแวดล้อม เพื่อการรักษาสิ่งแวดล้อม การใช้ทรัพยากรธรรมชาติอย่างมีคุณค่า และการพัฒนาเศรษฐกิจชุมชนอย่างยั่งยืน ให้เกิดสมดุลคืนสู่ธรรมชาติ ลดภาวะโลกร้อน เพื่อการอยู่ดี มีสุขของชุมชนและประชาคมโลก</p>

        <h2>พันธกิจ</h2>
        <p>วิทยาลัยพลังงานและสิ่งแวดล้อม มหาวิทยาลัยพะเยา มีภารกิจด้านการวิจัย การให้บริการทางสังคมการทำนุบำรุงศิลปะและวัฒนธรรม การให้บริการวิชาการ การจัดการเรียนการสอนในระดับ ปริญญาตรีและระดับบัณฑิตศึกษาด้านพลังงานและสิ่งแวดล้อม เพื่อการพัฒนาชุมชนของประเทศและของประชาคมโลก ด้วยการพัฒนาเทคโนโลยีพลังงานทดแทนและสิ่งแวดล้อม การอนุรักษ์พลังงานและทรัพยากรธรรมชาติ เพื่อการพัฒนาสังคมและเศรษฐกิจชุมชนอย่างยั่งยืน</p>
      </div>	
    </div>
@endsection