<?php

use Illuminate\Database\Seeder;

class DatabaseSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        // $this->call(UsersTableSeeder::class);
        $i=['ผู้ดูแลระบบ','ผู้ใช้งาน'];
        foreach ($i as $key) {
        	# code...
        	DB::table('privileges')->insert([
            'privileges_name'=>$key

        ]);
        }

      /*  DB::table('users')->insert([
            'username'=>'admin',
            'email'=>'maneewanpisit@gmail.com',
            'password'=>'$2y$10$Iye6yD1blu05IlRpJS6NBORfKKsaS2vhR1XSsCTM3xsx8EnDEPY9K',
            'first_name'=>'พิสิฐ',
            'last_name'=>'มณีวรรณ',
            'privileges_id'=>'1',
            'education'=>'-',
            'tel'=>'0877397471',
            'image'=>'admin.jpg',
            'research_gate'=>'',

        ]);*/

        

       /* $data = ['0'=>
            ['title' => 'ต้อนรับคณะกรรมการสิ่งแวดล้อมกองทัพอากาศ',
                'detail' => 'เมื่อวันที่ 11 มกราคม 2560 วิทยาลัยพลังงานและสิ่งแวดล้อม ได้ต้อนรับต้อนคณะกรรมการสิ่งแวดล้อมกองทัพอากาศ โดย พล.อ.อ.มานะ ประสพศรี และคณะ เข้าศึกษาดูงาน พร้อมรับฟังการบรรยาย เรื่อง “ระบบสถานีผลิตไฟฟ้า Campus Power จากเซลล์แสงอาทิตย์ ขนาด 500 กิโลวัตต์ บนเครือข่าย Smart Grid มหาวิทยาลัยพะเยา” ผู้บรรยาย รศ.ดร. วัฒนพงศ์ รักษ์วิเชียร และ “โคงการยกระดับคุณภาพชีวิตของชุมชน ด้วยการพัฒนาระบบการบริหารจัดการขยะอย่างยั่งยืน โดยชุมชนมีส่วนร่วมของมหาวิทยาลัยพะเยา” ผู้บรรยาย ผศ.ดร.ณภัทร จักรวัฒนา เพื่อนำแนวทางการจัดการดังกล่าวไปประยุกต์ใช้ในกองทัพอากาศ',
                'image1' => '1485060546.jpg',
                'user_id' => '1',
                'created_at' => '2017-01-22 04:49:06',
                'updated_at' => '2017-01-22 04:49:06',
                ],
            '1'=>['title' => 'ต้อนรับคณะกรรมการสิ่งแวดล้อมกองทัพอากาศ',
                'detail' => 'เมื่อวันที่ 11 มกราคม 2560 วิทยาลัยพลังงานและสิ่งแวดล้อม ได้ต้อนรับต้อนคณะกรรมการสิ่งแวดล้อมกองทัพอากาศ โดย พล.อ.อ.มานะ ประสพศรี และคณะ เข้าศึกษาดูงาน พร้อมรับฟังการบรรยาย เรื่อง “ระบบสถานีผลิตไฟฟ้า Campus Power จากเซลล์แสงอาทิตย์ ขนาด 500 กิโลวัตต์ บนเครือข่าย Smart Grid มหาวิทยาลัยพะเยา” ผู้บรรยาย รศ.ดร. วัฒนพงศ์ รักษ์วิเชียร และ “โคงการยกระดับคุณภาพชีวิตของชุมชน ด้วยการพัฒนาระบบการบริหารจัดการขยะอย่างยั่งยืน โดยชุมชนมีส่วนร่วมของมหาวิทยาลัยพะเยา” ผู้บรรยาย ผศ.ดร.ณภัทร จักรวัฒนา เพื่อนำแนวทางการจัดการดังกล่าวไปประยุกต์ใช้ในกองทัพอากาศ',
                'image1' => '1485040810.jpg',
                'user_id' => '1',
                'created_at' => '2017-01-22 04:49:06',
                'updated_at' => '2017-01-22 04:49:06',
                ],
            '3'=>['title' => 'ต้อนรับคณะกรรมการสิ่งแวดล้อมกองทัพอากาศ',
                'detail' => 'เมื่อวันที่ 11 มกราคม 2560 วิทยาลัยพลังงานและสิ่งแวดล้อม ได้ต้อนรับต้อนคณะกรรมการสิ่งแวดล้อมกองทัพอากาศ โดย พล.อ.อ.มานะ ประสพศรี และคณะ เข้าศึกษาดูงาน พร้อมรับฟังการบรรยาย เรื่อง “ระบบสถานีผลิตไฟฟ้า Campus Power จากเซลล์แสงอาทิตย์ ขนาด 500 กิโลวัตต์ บนเครือข่าย Smart Grid มหาวิทยาลัยพะเยา” ผู้บรรยาย รศ.ดร. วัฒนพงศ์ รักษ์วิเชียร และ “โคงการยกระดับคุณภาพชีวิตของชุมชน ด้วยการพัฒนาระบบการบริหารจัดการขยะอย่างยั่งยืน โดยชุมชนมีส่วนร่วมของมหาวิทยาลัยพะเยา” ผู้บรรยาย ผศ.ดร.ณภัทร จักรวัฒนา เพื่อนำแนวทางการจัดการดังกล่าวไปประยุกต์ใช้ในกองทัพอากาศ',
                'image1' => '1485053133.jpg',
                'user_id' => '1',
                'created_at' => '2017-01-22 04:49:06',
                'updated_at' => '2017-01-22 04:49:06',
                ],
        ];
        foreach($data as $q){
        DB::table('seennews')->insert($q);
    }*/

        
    }
}
